Scaxlibur/ADS126X_STM32hal/ADS126x/ADS126x.h
/**
 * @file : ADS126x.h
 * @date : May.24th.2025
 * @author : Scaxlibur
 * @brief : ADS1262 / ADS1263 的STM32HAL库驱动
 */

#ifndef ADS126X_H_
#define ADS126X_H_


// C Standard Libraries
#include <assert.h>
#include <stdint.h>
#include "stm32f4xx_hal.h"
#include "gpio.h"

//this depends on how many bytes is composed the incoming data
//(1 status byte + 4 byte of data)
#define ADS126x_DATA_BUF_SIZE 5

// SELECT A DEVICE
//#define ADS1262	//Standard definitions for both ADS1262 and ADS1263 devices
#define ADS1263		//Additional definitions to support ADS1263 additional features

typedef struct {
	long int Value;
	uint8_t Status;
	uint8_t Checksum;
} ADS126xData_t;

//BEGIN ADC DEFINITIONS

#ifdef ADS1262
	#define ADS126x_NUM_REG 					(0x15)			/* ADS1262 has 21 registers */
#endif  
#ifdef ADS1263
	#define ADS126x_NUM_REG 					(0x1B)			/* ADS1263 has 27 registers */
#endif


/* SPI Commands */
	#define NOP									(0x00)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define RESET1								(0x06)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define START1								(0x08)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define STOP1								(0x0B)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define RDATA1								(0x12)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define SYOCAL1								(0x16)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define SYGCAL1								(0x17)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define SFOCAL1								(0x19)			/* ID/CFG REGISTER (ADDRESS 00h) */
	//Multi-Byte Commands
		#define RREG							(0x20)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define WREG							(0x40)			/* ID/CFG REGISTER (ADDRESS 00h) */
	/* Additional ADS1263 Commands */
	#ifdef ADS1263
		#define START2							(0x0C)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define STOP2							(0x0E)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define RDATA2							(0x14)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define SYOCAL2							(0x1B)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define SYGCAL2							(0x1C)			/* ID/CFG REGISTER (ADDRESS 00h) */
		#define SFOCAL2							(0x1E)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#endif



/* STATUS Byte Masks */
	#define	ADC2_NEW							(0x80)			/* Indicates new ADC2 data */
	#define	ADC1_NEW							(0x40)			/* Indicates new ADC1 data */
	#define	EXTCLK								(0x20)			/* Indicates ADC clock source */
	#define	REF_ALM								(0x10)			/* Low Reference Alarm   - Only used with ADC1 */
	#define	PGAL_ALM							(0x08)			/* PGA Output Low Alarm  - Only used with ADC1 */
	#define	PGAH_ALM							(0x04)			/* PGA Output High Alarm - Only used with ADC1 */
	#define	PGAD_ALM							(0x02)			/* PGA Diff Output Alarm - Only used with ADC1 */
	#define	RST_ALM								(0x01)			/* Indicates device reset (re-named to avoid conflict) */


/* Register Addresses */
	#define ID									(0x00)			/* 设备识别寄存器 ID/CFG REGISTER (ADDRESS 00h) */
	#define POWER1 								(0x01)			/* 电源寄存器 CONFIGURATION REGISTER 0 (ADDRESS 01h) */
	#define INTERFACE							(0x02)			/* 接口寄存器 CONFIGURATION REGISTER 1 (ADDRESS 02h) */
	#define MODE0								(0x03)			/* 模式0寄存器 High-Pass Filter Corner Frequency, Low Byte (Address 03h) */
	#define MODE1								(0x04)			/* 模式1寄存器 High-Pass Filter Corner Frequency, High Byte (Address 04h) */
	#define MODE2								(0x05)			/* 模式2寄存器 Offset Calibration, Low Byte (Address 05h) */
	#define INPMUX								(0x06)			/* 输入多路复用器寄存器 Offset Calibration, Mid Byte (Address 06h) */
	#define OFCAL0								(0x07)			/* 偏移校准寄存器0 Offset Calibration, High Byte (Address 07h) */
	#define OFCAL1								(0x08)			/* 偏移校准寄存器1 Full-Scale Calibration, Low Byte (Address 08h) */
	#define OFCAL2								(0x09)			/* 偏移校准寄存器2 Full-Scale Calibration, Mid Byte (Address 09h) */
	#define FSCAL0								(0x0A)			/* 全量程校准寄存器0 Full-Scale Calibration, High Byte (Address 0Ah) */
	#define FSCAL1								(0x0B)			/* 全量程校准寄存器1 */
	#define FSCAL2								(0x0C)			/* 全量程校准寄存器2 */
	#define IDACMUX								(0x0D)			/* IDACMUX寄存器 */
	#define IDACMAG								(0x0E)			/* IDACMAG寄存器 */
	#define REFMUX								(0x0F)			/* REFMUX寄存器 */
	#define TDACP								(0x10)			/* TDACP控制寄存器 */
	#define TDACN								(0x11)			/* TDACN 控制寄存器 */
	#define GPIOCON								(0x12)			/* GPIO连接寄存器 */
	#define GPIODIR								(0x13)			/* GPIO方向寄存器 */
	#define GPIODAT								(0x14)			/* GPIO数据寄存器 */
	/* Additional ADS1263 Registers */
	#ifdef ADS1263
		#define ADC2CFG							(0x15)			/* ADC2配置寄存器 */
		#define ADC2MUX							(0x16)			/* ADC2输入多路复用器寄存器 */
		#define ADC2OFC0						(0x17)			/* ADC2偏移校准寄存器0 */
		#define ADC2OFC1						(0x18)			/* ADC2偏移校准寄存器1 */
		#define ADC2FSC0						(0x19)			/* ADC2满量程校准寄存器0 */
		#define ADC2FSC1						(0x1A)			/* ADC2满量程校准寄存器1 */
	#endif /* ADS1263 */


/* Default Register Values */
//	#define ID_DEFAULT_VALUE					(0x00)			/* ID/CFG REGISTER (ADDRESS 00h) */
	#define POWER_DEFAULT_VALUE					(0x19)			/* CONFIGURATION REGISTER 0 (ADDRESS 01h) */
	#define INTERFACE_DEFAULT_VALUE				(0x05)			/* CONFIGURATION REGISTER 1 (ADDRESS 02h) */
	#define MODE0_DEFAULT_VALUE					(0x00)			/* High-Pass Filter Corner Frequency, Low Byte (Address 03h) */
	#define MODE1_DEFAULT_VALUE					(0x80)			/* High-Pass Filter Corner Frequency, High Byte (Address 04h) */
	#define MODE2_DEFAULT_VALUE					(0x04)			/* Offset Calibration, Low Byte (Address 05h) */
	#define INPMUX_DEFAULT_VALUE				(0x01)			/* Offset Calibration, Mid Byte (Address 06h) */
	#define OFCAL0_DEFAULT_VALUE				(0x00)			/* Offset Calibration, High Byte (Address 07h) */
	#define OFCAL1_DEFAULT_VALUE				(0x00)			/* Full-Scale Calibration, Low Byte (Address 08h) */
	#define OFCAL2_DEFAULT_VALUE				(0x00)			/* Full-Scale Calibration, Mid Byte (Address 09h) */
	#define FSCAL0_DEFAULT_VALUE				(0x00)			/* Full-Scale Calibration, High Byte (Address 0Ah) */
	#define FSCAL1_DEFAULT_VALUE				(0x00)
	#define FSCAL2_DEFAULT_VALUE				(0x40)
	#define IDACMUX_DEFAULT_VALUE				(0xBB)
	#define IDACMAG_DEFAULT_VALUE				(0x00)
	#define REFMUX_DEFAULT_VALUE				(0x00)
	#define TDACP_DEFAULT_VALUE					(0x00)
	#define TDACN_DEFAULT_VALUE					(0x00)
	#define GPIOCON_DEFAULT_VALUE				(0x00)
	#define GPIODIR_DEFAULT_VALUE				(0x00)
	#define GPIODAT_DEFAULT_VALUE				(0x00)

	#ifdef ADS1263
		#define ADC2CFG_DEFAULT_VALUE			(0x00)
		#define ADC2MUX_DEFAULT_VALUE			(0x01)
		#define ADC2OFC0_DEFAULT_VALUE			(0x00)
		#define ADC2OFC1_DEFAULT_VALUE			(0x00)
		#define ADC2FSC0_DEFAULT_VALUE			(0x00)
		#define ADC2FSC1_DEFAULT_VALUE			(0x40)
	#endif /* ADS1263 */


/* Register Field Definitions */

	/* POWER Register Fields */
		#define RST 							(0x10)			/* Indicates ADC reset has occurred. Clear this bit to detect the next device reset. */
		#define VBIAS 							(0x02)			/* Enables the internal level shift voltage to the AINCOM pin. */
		#define INTREF 							(0x01)			/* Enables the 2.5 V internal voltage reference. Note the IDAC and temperature sensor require the internal voltage reference. */

