Scaxlibur/ADS126X_STM32hal/ADS126x/ADS126x.h
	/* INTERFACE Register Fields */
		#define TIMEOUT 						(0x08)			/* Enables the serial interface automatic time-out mode */
		#define STATUS 							(0x04)			/* Enables the inclusion of the status byte during conversion data read-back */
//		#define CRC1 							(0x02)
//		#define CRC0 							(0x01)
		#define CRC_MASK						(0x03)			/* Enables the inclusion of the checksum byte during conversion data read-back */
			//CRC Field
			#define CRC_OFF						(0x00)			/* Checksum byte disabled */
			#define CRC_CHKSUM					(0x01)			/* Enable Checksum byte in Checksum mode during conversion data read-back (default) */
			#define CRC_ON						(0x02)			/* Enable Checksum byte in CRC mode during conversion data read-back */

	/* MODE0 Register Fields */
		#define REFREV							(0x80)			/* Reference Mux Polarity Reversal */
		#define RUNMODE							(0x40)			/* Selects the ADC conversion (run) mode */
//		#define CHOP1 							(0x20)
//		#define CHOP0 							(0x10)
		#define CHOP_MASK						(0x30)			/* Enables the ADC chop and IDAC rotation options */
			//CHOP Field
			#define CHOP_OFF					(0x00)			/* Input chop and IDAC rotation disabled (default) */
			#define CHOP_ON						(0x10)			/* Input chop enabled */
			#define CHOP_IDAC					(0x20)			/* IDAC rotation enabled */
			#define CHOP_ON_IDAC				(0x30)			/* Input chop and IDAC rotation enabled */
//		#define DELAY3 							(0x08)
//		#define DELAY2 							(0x04)
//		#define DELAY1 							(0x02)
//		#define DELAY0 							(0x01)
		#define DELAY_MASK						(0x0F)			/* Additional Settling Delay Field */
			//DELAY Field
			#define DELAY_0us					(0x00)
			#define DELAY_8_7us					(0x01)
			#define DELAY_17us					(0x02)
			#define DELAY_35us					(0x03)
			#define DELAY_69us					(0x04)
			#define DELAY_139us					(0x05)
			#define DELAY_278us					(0x06)
			#define DELAY_555us					(0x07)
			#define DELAY_1100us				(0x08)
			#define DELAY_2200us				(0x09)
			#define DELAY_4400us				(0x0A)
			#define DELAY_8800us				(0x0B)

	/* MODE1 Register Fields */
//		#define FILTER_2 						(0x80)
//		#define FILTER_1 						(0x40)
//		#define FILTER_0 						(0x20)
		#define FILTER_MASK						(0xE0) 			/* Configures the ADC digital filter */
			//DELAY Field
			#define FILTER_SINC1				(0x00)			/* Sinc1 mode */
			#define FILTER_SINC2				(0x20)			/* Sinc2 mode */
			#define FILTER_SINC3				(0x40)			/* Sinc3 mode */
			#define FILTER_SINC4				(0x60)			/* Sinc4 mode */
			#define FILTER_FIR					(0x80)			/* FIR mode(default) */
		#define SBADC 							(0x10)			/* Selects the ADC to connect the sensor bias */
		#define SBPOL 							(0x08)			/* Selects the sensor bias for pull-up or pull-down */
//		#define SBMAG2 							(0x04)
//		#define SBMAG1 							(0x02)
//		#define SBMAG0 							(0x01)
		#define SBMAG_MASK						(0x07)			/* Selects the sensor bias current magnitude or the bias resistor */
			//SBMAG Field
			#define SBMAG_0uA					(0x00)			/* No sensor bias current or resistor (default) */
			#define SBMAG_0_5uA					(0x01)			/* 0.5-μA sensor bias current */
			#define SBMAG_2uA					(0x02)			/* 2-μA sensor bias current */
			#define SBMAG_10uA					(0x03)			/* 10-μA sensor bias current */
			#define SBMAG_50uA					(0x04)			/* 50-μA sensor bias current */
			#define SBMAG_200uA					(0x05)			/* 200-μA sensor bias current */
			#define SBMAG_10MOhm				(0x06)			/* 10-MΩ resistor */

	/* MODE2 Register Fields */
		#define BYPASS							(0x80)			/* Selects PGA bypass mode */
//		#define GAIN2 							(0x40)
//		#define GAIN1 							(0x20)
//		#define GAIN0 							(0x10)
		#define GAIN_MASK						(0x70)			/* Selects the PGA gain */
			//GAIN Field
			#define GAIN_1						(0x00)
			#define GAIN_2						(0x10)
			#define GAIN_4						(0x20)
			#define GAIN_8						(0x30)
			#define GAIN_16						(0x40)
			#define GAIN_32						(0x50)
//		#define DR3 							(0x08)
//		#define DR2 							(0x04)
//		#define DR1 							(0x02)
//		#define DR0 							(0x01)
		#define DR_MASK							(0x0F)			/* Selects the ADC data rate. In FIR filter mode, the available datarates are limited to 2.5, 5, 10 and 20 SPS */
			//DR Field
			#define DR_2_5_SPS					(0x00)
			#define DR_5_SPS					(0x01)
			#define DR_10_SPS					(0x02)
			#define DR_16_6_SPS					(0x03)
			#define DR_20_SPS					(0x04)
			#define DR_50_SPS					(0x05)
			#define DR_60_SPS					(0x06)
			#define DR_100_SPS					(0x07)
			#define DR_400_SPS					(0x08)
			#define DR_1200_SPS					(0x09)
			#define DR_2400_SPS					(0x0A)
			#define DR_4800_SPS					(0x0B)
			#define DR_7200_SPS					(0x0C)
			#define DR_14400_SPS				(0x0D)
			#define DR_19200_SPS				(0x0E)
			#define DR_38400_SPS				(0x0F)


	/* INPMUX Register Fields */
//		#define MUXP_3 							(0x80)
//		#define MUXP_2 							(0x40)
//		#define MUXP_1 							(0x20)
//		#define MUXP_0 							(0x10)
		#define MUXP_MASK						(0xF0)			/* Selects the positive input multiplexer */
			//MUXP Field
			#define MUXP_AIN0					(0x00)
			#define MUXP_AIN1					(0x10)
			#define MUXP_AIN2					(0x20)
			#define MUXP_AIN3					(0x30)
			#define MUXP_AIN4					(0x40)
			#define MUXP_AIN5					(0x50)
			#define MUXP_AIN6					(0x60)
			#define MUXP_AIN7					(0x70)
			#define MUXP_AIN8					(0x80)
			#define MUXP_AIN9					(0x90)
			#define MUXP_AINCOM					(0xA0)
			#define MUXP_TEMP					(0xB0)
			#define MUXP_AVDD					(0xC0)
			#define MUXP_DVDD					(0xD0)
			#define MUXP_TEST					(0xE0)
			#define MUXP_NO_CONN				(0xF0)
//		#define MUXN_3 							(0x08)
//		#define MUXN_2 							(0x04)
//		#define MUXN_1 							(0x02)
//		#define MUXN_0 							(0x01)
		#define MUXN_MASK						(0x0F)			/* Selects the negative input multiplexer */
			//MUXN Field
			#define MUXN_AIN0					(0x00)
			#define MUXN_AIN1					(0x01)
			#define MUXN_AIN2					(0x02)
			#define MUXN_AIN3					(0x03)
			#define MUXN_AIN4					(0x04)
			#define MUXN_AIN5					(0x05)
			#define MUXN_AIN6					(0x06)
			#define MUXN_AIN7					(0x07)
			#define MUXN_AIN8					(0x08)
			#define MUXN_AIN9					(0x09)
			#define MUXN_AINCOM					(0x0A)
			#define MUXN_TEMP					(0x0B)
			#define MUXN_AVSS					(0x0C)
			#define MUXN_DVDD					(0x0D)
			#define MUXN_TEST					(0x0E)
			#define MUXN_NO_CONN				(0x0F)

	//SKIP OFFSET & GAIN CAL REGISTERS

