Scaxlibur/ADS126X_STM32hal/ADS126x/ADS126x.h
	/* IDACMUX Register Fields */
//		#define MUX2_3 							(0x80)
//		#define MUX2_2 							(0x40)
//		#define MUX2_1  						(0x20)
//		#define MUX2_0 							(0x10)
		#define MUX2_MASK						(0xF0)			/* Selects the analog input pin to connect IDAC2 */
			//MUX2 Field
			#define MUX2_AIN0					(0x00)
			#define MUX2_AIN1					(0x10)
			#define MUX2_AIN2					(0x20)
			#define MUX2_AIN3					(0x30)
			#define MUX2_AIN4					(0x40)
			#define MUX2_AIN5					(0x50)
			#define MUX2_AIN6					(0x60)
			#define MUX2_AIN7					(0x70)
			#define MUX2_AIN8					(0x80)
			#define MUX2_AIN9					(0x90)
			#define MUX2_AINCOM					(0xA0)
			#define MUX2_NO_CONM				(0xB0)
//		#define MUX1_3 							(0x08)
//		#define MUX1_2 							(0x04)
//		#define MUX1_1 							(0x02)
//		#define MUX1_0 							(0x01)
		#define MUX1_MASK						(0x0F)			/* Selects the analog input pin to connect IDAC1 */
			//MUX1 Field
			#define MUX1_AIN0					(0x00)
			#define MUX1_AIN1					(0x01)
			#define MUX1_AIN2					(0x02)
			#define MUX1_AIN3					(0x03)
			#define MUX1_AIN4					(0x04)
			#define MUX1_AIN5					(0x05)
			#define MUX1_AIN6					(0x06)
			#define MUX1_AIN7					(0x07)
			#define MUX1_AIN8					(0x08)
			#define MUX1_AIN9					(0x09)
			#define MUX1_AINCOM					(0x0A)
			#define MUX1_NO_CONM				(0x0B)

	/* IDACMAG Register Fields */
//		#define MAG2_3 							(0x80)
//		#define MAG2_2 							(0x40)
//		#define MAG2_1 							(0x20)
//		#define MAG2_0 							(0x10)
		#define MAG2_MASK						(0xF0)			/* Selects the current values of IDAC2 */
			//MAG2 Field
			#define MAG2_OFF					(0x00)
			#define MAG2_50uA					(0x10)
			#define MAG2_100uA					(0x20)
			#define MAG2_250uA					(0x30)
			#define MAG2_500uA					(0x40)
			#define MAG2_750uA					(0x50)
			#define MAG2_1000uA					(0x60)
			#define MAG2_1500uA					(0x70)
			#define MAG2_2000uA					(0x80)
			#define MAG2_2500uA					(0x90)
			#define MAG2_3000uA					(0xA0)
//		#define MAG1_3							(0x08)
//		#define MAG1_2 							(0x04)
//		#define MAG1_1 							(0x02)
//		#define MAG1_0 							(0x01)
		#define MAG1_MASK						(0xF0)			/* IDAC1 Current Magnitude */
			//MAG1 Field
			#define MAG1_OFF					(0x00)
			#define MAG1_50uA					(0x01)
			#define MAG1_100uA					(0x02)
			#define MAG1_250uA					(0x03)
			#define MAG1_500uA					(0x04)
			#define MAG1_750uA					(0x05)
			#define MAG1_1000uA					(0x06)
			#define MAG1_1500uA					(0x07)
			#define MAG1_2000uA					(0x08)
			#define MAG1_2500uA					(0x09)
			#define MAG1_3000uA					(0x0A)

	/* REFMUX Register Fields */
//		#define RMUXP_2	 						(0x20)
//		#define RMUXP_1	 						(0x10)
//		#define RMUXP_0	 						(0x08)
		#define RMUXP_MASK						(0x38)			/* Selects the positive reference input */
			//MUXP Field
			#define RMUXP_INTP					(0x00)
			#define RMUXP_AIN0					(0x08)
			#define RMUXP_AIN2					(0x10)
			#define RMUXP_AIN4					(0x18)
			#define RMUXP_AVDD					(0x20)
//		#define RMUXN_2	 						(0x04)
//		#define RMUXN_1	 						(0x02)
//		#define RMUXN_0	 						(0x01)
		#define RMUXN_MASK						(0x07)			/* Reference Negative Input */
			//MUXN Field
			#define RMUXN_INTN					(0x00)
			#define RMUXN_AIN1					(0x01)
			#define RMUXN_AIN3					(0x02)
			#define RMUXN_AIN5					(0x03)
			#define RMUXN_AVSS					(0x04)

	/* TDACP Register Fields */
		#define OUTP	 						(0x80)			/* Connects TDACP output to pin AIN6 */
		//OUTP Field
			#define OUTP_NO_CONN				(0x00)
			#define OUTP_AIN6					(0x80)			/* TDACP output connected to pin AIN6 */
//		#define MAGP4	 						(0x10)
//		#define MAGP3	 						(0x08)
//		#define MAGP2	 						(0x04)
//		#define MAGP1	 						(0x02)
//		#define MAGP0	 						(0x01)
		#define MAGP_MASK						(0x1F)			/* Select the TDACP output magnitude. The TDAC output voltages are ideal and are with respect to VAVSS */
			//MAGP Field
			#define MAGP_0_9_AVDD				(0x09)
			#define MAGP_0_7_AVDD				(0x08)
			#define MAGP_0_6_AVDD				(0x07)
			#define MAGP_0_55_AVDD				(0x06)
			#define MAGP_0_525_AVDD				(0x05)
			#define MAGP_0_5125_AVDD			(0x04)
			#define MAGP_0_50625_AVDD			(0x03)
			#define MAGP_0_503125_AVDD			(0x02)
			#define MAGP_0_5015625_AVDD			(0x01)
			#define MAGP_0_5_AVDD				(0x00)
			#define MAGP_0_4984375_AVDD			(0x11)
			#define MAGP_0_496875_AVDD			(0x12)
			#define MAGP_0_49375_AVDD			(0x13)
			#define MAGP_0_4875_AVDD			(0x14)
			#define MAGP_0_475_AVDD				(0x15)
			#define MAGP_0_45_AVDD				(0x16)
			#define MAGP_0_4_AVDD				(0x17)
			#define MAGP_0_3_AVDD				(0x18)
			#define MAGP_0_1_AVDD				(0x19)

	/* TDACN Register Fields */
		#define OUTN	 						(0x80)			/* Connects TDACN output to pin AIN7 */
		//OUTN Field
			#define OUTN_NO_CONN				(0x00)
			#define OUTN_AIN7					(0x80)			/* TDACN output connected to pin AIN7 */
//		#define MAGN4	 						(0x10)
//		#define MAGN3	 						(0x08)
//		#define MAGN2	 						(0x04)
//		#define MAGN1	 						(0x02)
//		#define MAGN0	 						(0x01)
		#define MAGN_MASK						(0x1F)			/* Select the TDACN output magnitude. The TDAC output voltages are ideal and are with respect to VAVSS */
			//MAGN Field
			#define MAGN_0_9_AVSS				(0x09)
			#define MAGN_0_7_AVSS				(0x08)
			#define MAGN_0_6_AVSS				(0x07)
			#define MAGN_0_55_AVSS				(0x06)
			#define MAGN_0_525_AVSS				(0x05)
			#define MAGN_0_5125_AVSS			(0x04)
			#define MAGN_0_50625_AVSS			(0x03)
			#define MAGN_0_503125_AVSS			(0x02)
			#define MAGN_0_5015625_AVSS			(0x01)
			#define MAGN_0_5_AVSS				(0x00)
			#define MAGN_0_4984375_AVSS			(0x11)
			#define MAGN_0_496875_AVSS			(0x12)
			#define MAGN_0_49375_AVSS			(0x13)
			#define MAGN_0_4875_AVSS			(0x14)
			#define MAGN_0_475_AVSS				(0x15)
			#define MAGN_0_45_AVSS				(0x16)
			#define MAGN_0_4_AVSS				(0x17)
			#define MAGN_0_3_AVSS				(0x18)
			#define MAGN_0_1_AVSS				(0x19)

	/* GPIOCON Register Fields */								/* 默认不将GPIO和模拟输入连接 */
		#define CON7_AINCOM						(0x80)			/* Connects GPIO[7] to analog input pin AINCOM */
		#define CON6_AIN09						(0x40)
		#define CON5_AIN08						(0x20)
		#define CON4_AIN07						(0x10)
		#define CON3_AIN06						(0x08)
		#define CON2_AIN05						(0x04)
		#define CON1_AIN04						(0x02)
		#define CON0_AIN03						(0x01)

	/* GPIODIR Register Fields */								/* 默认的GPIO方向是输入 */
		#define DIR7_AINCOM						(0x80)			/* Configures GPIO[7] as a GPIO input */
		#define DIR6_AIN09						(0x40)
		#define DIR5_AIN08						(0x20)
		#define DIR4_AIN07						(0x10)
		#define DIR3_AIN06						(0x08)
		#define DIR2_AIN05						(0x04)
		#define DIR1_AIN04						(0x02)
		#define DIR0_AIN03						(0x01)

	/* GPIODAT Register Fields */
		#define DAT7_AINCOM						(0x80)			/* Configured as an output, read returns 0b ; Configured as an input, write sets the register value only */
		#define DAT6_AIN09						(0x40)
		#define DAT5_AIN08						(0x20)
		#define DAT4_AIN07						(0x10)
		#define DAT3_AIN06						(0x08)
		#define DAT2_AIN05						(0x04)
		#define DAT1_AIN04						(0x02)
		#define DAT0_AIN03						(0x01)


