Scaxlibur/ADS126X_STM32hal/ADS126x/ADS126x.h
		/* Additional ADS1263 Registers */
		#ifdef ADS1263

			/* ADC2CFG Register Fields */
//					#define DR2_1	 			(0x80)
//					#define DR2_0	 			(0x40)
			#define DR2_MASK					(0xC0)			/* These bits select the data rate of ADC2 */
				//DR_2 Field
					#define DR2_10SPS			(0x00)
					#define DR2_100SPS			(0x40)
					#define DR2_400SPS			(0x80)
					#define DR2_800SPS			(0xC0)
//					#define REF2_2	 			(0x20)
//					#define REF2_1				(0x10)
//					#define REF2_0	 			(0x08)
			#define REF2_MASK					(0x38)			/* Selects the reference inputs of ADC2 as positive and negative pairs */
				//REF2 Field
					#define REF2_INTP_INTN		(0x00)			/* Internal 2.5 V reference, positive and negative (default) */
					#define REF2_AIN0_AIN1		(0x08)			/* External AIN0 and AIN1 pin pairs as positive and negative */
					#define REF2_AIN2_AIN3		(0x10)
					#define REF2_AIN4_AIN5		(0x18)
					#define REF2_AVDD_AVSS		(0x38)			/* Internal VAVDD and VAVSS */
//					#define GAIN2_2	 			(0x04)
//					#define GAIN2_1				(0x02)
//					#define GAIN2_0				(0x01)
			#define GAIN2_MASK					(0x07)			/* These bits configure the gain of ADC2 */
				//GAIN2 Field
					#define GAIN2_1				(0x00)
					#define GAIN2_2				(0x01)
					#define GAIN2_4				(0x02)
					#define GAIN2_8				(0x03)
					#define GAIN2_16			(0x04)
					#define GAIN2_32			(0x05)
					#define GAIN2_64			(0x06)
					#define GAIN2_128			(0x07)


			/* ADC2MUX Register Fields */
//					#define MUXP2_3	 			(0x80)
//					#define MUXP2_2	 			(0x40)
//					#define MUXP2_1	 			(0x20)
//					#define MUXP2_0				(0x10)
				#define MUXP2_MASK				(0xF0)			/* Selects the ADC2 positive input */
				//MUXP2 Field
					#define MUXP2_AIN0			(0x00)
					#define MUXP2_AIN1			(0x10)
					#define MUXP2_AIN2			(0x20)
					#define MUXP2_AIN3			(0x30)
					#define MUXP2_AIN4			(0x40)
					#define MUXP2_AIN5			(0x50)
					#define MUXP2_AIN6			(0x60)
					#define MUXP2_AIN7			(0x70)
					#define MUXP2_AIN8			(0x80)
					#define MUXP2_AIN9			(0x90)
					#define MUXP2_AINCOM		(0xA0)
					#define MUXP2_TEMP			(0xB0)			/* Temperature sensor monitor positive */
					#define MUXP2_AVDD			(0xC0)			/* Analog power supply monitor positive */
					#define MUXP2_DVDD			(0xD0)			/* Digital power supply monitor positive */
					#define MUXP2_TEST			(0xE0)			/* TDAC test signal positive */
					#define MUXP2_NO_CONN		(0xF0)			/* Open connection */
//					#define MUXN2_3	 			(0x08)
//					#define MUXN2_2	 			(0x04)
//					#define MUXN2_1				(0x02)
//					#define MUXN2_0				(0x01)
				#define MUXN2_MASK				(0x0F)			/* Selects the ADC2 negative input */
					//MUXN2 Field
					#define MUXN2_AIN0			(0x00)
					#define MUXN2_AIN1			(0x01)
					#define MUXN2_AIN2			(0x02)
					#define MUXN2_AIN3			(0x03)
					#define MUXN2_AIN4			(0x04)
					#define MUXN2_AIN5			(0x05)
					#define MUXN2_AIN6			(0x06)
					#define MUXN2_AIN7			(0x07)
					#define MUXN2_AIN8			(0x08)
					#define MUXN2_AIN9			(0x09)
					#define MUXN2_AINCOM		(0x0A)
					#define MUXN2_TEMP			(0x0B)			/* Temperature sensor monitor positive */
					#define MUXN2_AVSS			(0x0C)			/* Analog power supply monitor positive */
					#define MUXN2_DVDD			(0x0D)			/* Digital power supply monitor positive */
					#define MUXN2_TEST			(0x0E)			/* TDAC test signal positive */
					#define MUXN2_NO_CONN		(0x0F)			/* Open connection */

				//SKIP ADC2 OFFSET & GAIN CAL REGISTERS

		#endif /* ADS1263 */

//END ADC DEFINITIONS


/* Function Prototypes */

// Low level

void ADS126xSetCS(uint8_t state);						// CS pin control
void set_adc_START(uint8_t state);					// START pin control
unsigned char ADS126xXferByte (uint8_t cData);	// receive byte, simultaneously send data - this function realizes all
													// necessary functionality, the other Send/Receive methods are only
													// designed to improve readability of the code
unsigned ADS126xXferBytes(uint8_t* txData, uint8_t* rxData, uint16_t lenght);

// Higher level

ADS126xData_t ADS126xReadData(uint8_t NumBytes, uint8_t DataByteStartNum);

//int32_t ADS126xREADandWRITE(int NumDatBytes, int StartAddress, int NumRegs, unsigned char * pdata);
//unsigned char ADS126xReadADC2Data(bufferType_t *readbuffer);

// read a number of consecutive registers to a given array pointer
void ADS126xReadRegister(int StartAddress, int NumRegs, unsigned char *pdata);

// write a number of consecutive registers from a given array pointer
void ADS126xWriteMultiRegister(int StartAddress, int NumRegs, unsigned char *pdata);

// Reset by command (alternative to pin)
void ADS126xSendResetCommand(void);

// Start by command (alternative to pin)
void ADS126xSendStartCommand(void);

void ADS126xSendStopCommand(void);
void ADS126xSendADC2StartCommand(void);
void ADS126xSendADC2StopCommand(void);
void ADS126xInitADC1(void);
void ADS126xWriteRegister(uint8_t, uint8_t);



#endif /* ADS126X_H_ */
